embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/middleware/dsp/audio_framework/hifi4_app/plugins/cadence/capturer/evk_hal_registers.c
/*
 * The Clear BSD License
 * Copyright (c) 2016, NXP Semiconductors.
 * All rights reserved.
 *
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 *  that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <assert.h>
#include "evk_hal_registers.h"
#include "fsl_i2c.h"
#include "fsl_common.h"
#include "fsl_debug_console.h"

#define DEMO_I2C I2C4
//#define DEMO_VERBOSE
//#define TFA98XX_PRINT_DEBUG
#if defined(TFA98XX_PRINT_DEBUG)
#define printf PRINTF
#endif

Tfa9890_Error_t read_register(uint8_t slave_address, uint8_t subaddress, unsigned short * value)
{
	i2c_master_transfer_t transfer;
	Tfa9890_Error_t err = Error_Ok;
    uint8_t retval = 0;
#if defined(DEMO_VERBOSE)
    int i;
#endif

	transfer.flags = 0;
	transfer.slaveAddress = slave_address;
	transfer.direction = kI2C_Read;
	transfer.subaddress = subaddress;
	transfer.subaddressSize = 1;
	transfer.data = (void *)malloc(sizeof(short));
	transfer.dataSize = sizeof(short);

	retval = I2C_MasterTransferBlocking(DEMO_I2C, &transfer);
    if (retval != kStatus_Success)
    {
        err = Error_I2C_Fatal;
        goto error_return;
    }

	if(transfer.dataSize == 2) {
	    memcpy(value, transfer.data, 2);
		*value = (*value <<8) | ((*value >> 8) & 0x00ff);
	}
	else
		err = Error_I2C_Fatal;
#if defined(DEMO_VERBOSE)
    PRINTF("R(0x%02x):", subaddress);
    for(i=0; i<transfer.dataSize;i++)
    	PRINTF("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    PRINTF("\r\n");
#endif
error_return:
	free(transfer.data);
	return err;
}

int tfa98xx_read_reg(uint8_t slave_address, const uint16_t bf)
{

	Tfa9890_Error_t err = Error_Ok;
	uint16_t regvalue = 0;

	/* bitfield enum - 8..15 : address */
	uint8_t address = (bf >> 8) & 0xff;

	err = read_register(slave_address, address, &regvalue);
	if (err)
		return -err;

	return regvalue;
}

Tfa9890_Error_t write_register(uint8_t slave_address, uint8_t subaddress, uint16_t value)
{
	i2c_master_transfer_t transfer;
	Tfa9890_Error_t err = Error_Ok;
    uint8_t retval = 0;
    uint8_t temp[2] = {0};
#if defined(DEMO_VERBOSE)
    int i;
#endif

	transfer.flags = 0;
	transfer.slaveAddress = slave_address;
	transfer.direction = kI2C_Write;
	transfer.subaddress = subaddress;
	transfer.subaddressSize = 1;
	transfer.data = (void *)malloc(sizeof(short));
	transfer.dataSize = sizeof(short);
    temp[0] = (value >> 8);;
    temp[1] = value;
    memcpy(transfer.data, (void *)temp, 2);

	retval = I2C_MasterTransferBlocking(DEMO_I2C, &transfer);
    if (retval != kStatus_Success)
    {
        err = Error_I2C_Fatal;
    }
#if defined(DEMO_VERBOSE)
    PRINTF("W(0x%02x):", subaddress);
    for(i=0; i<transfer.dataSize;i++)
    	PRINTF("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    PRINTF("\r\n");
#endif
    free(transfer.data);
	return err;
}

uint16_t tfa_get_bf_tfa98xx(uint8_t slave_address, const uint16_t bf)
{
	uint16_t regvalue = 0;
	uint16_t msk = 0;
	uint16_t value;
	uint8_t len = bf & 0x0f;
	uint8_t pos = (bf >> 4) & 0x0f;
	uint8_t address = (bf >> 8) & 0xff;

	read_register(slave_address, address,&regvalue);
	msk = ((1<<(len+1))-1)<<pos;
	regvalue &= msk;
	value = regvalue>>pos;
	return value;
}

Tfa9890_Error_t tfa_set_bf_tfa98xx(uint8_t slave_address, const uint16_t bf, const uint16_t value)
{
	Tfa9890_Error_t err=Error_Ok;
	uint16_t regvalue = 0;
	uint16_t msk, oldvalue;
	uint8_t len = (bf & 0x0f);
	uint8_t pos = (bf >> 4) & 0x0f;
	uint8_t address = (bf >> 8) & 0xff;

	err = read_register(slave_address, address,&regvalue);
	oldvalue = regvalue;
	msk = ((1<<(len+1))-1)<<pos;
	regvalue &= ~msk;
	regvalue |= value<<pos;

	if(oldvalue != regvalue)
		err = write_register(slave_address, (bf >> 8) & 0xff, regvalue);

	return err;
}

int tfa98xx_set_bf_value(uint8_t slave_address, const uint16_t bf, const uint16_t bf_value, uint16_t *p_reg_value)
{
	uint16_t regvalue, msk;

	/*
	 * bitfield enum:
	 * - 0..3  : len
	 * - 4..7  : pos
	 * - 8..15 : address
	 */
	uint8_t len = bf & 0x0f;
	uint8_t pos = (bf >> 4) & 0x0f;
	regvalue = *p_reg_value;
	msk = ((1<<(len+1))-1)<<pos;
	regvalue &= ~msk;
	regvalue |= bf_value<<pos;
	*p_reg_value = regvalue;

	return 0;
}

/***********************/
Tfa9890_Error_t Tfa98xx_ReadData(uint8_t slave_address, unsigned char subaddress, int num_bytes, unsigned char data[])
{
	i2c_master_transfer_t transfer;
	Tfa9890_Error_t err = Error_Ok;
    uint8_t retval = 0;
#if defined(DEMO_VERBOSE)
    int i;
#endif

	transfer.flags = 0;
	transfer.slaveAddress = slave_address;
	transfer.direction = kI2C_Read;
	transfer.subaddress = subaddress;
	transfer.subaddressSize = 1;
	transfer.data = data;
	transfer.dataSize = num_bytes;

	retval = I2C_MasterTransferBlocking(DEMO_I2C, &transfer);
    if (retval != kStatus_Success)
    {
        err = Error_I2C_Fatal;
    }

#if defined(DEMO_VERBOSE)
    PRINTF("R(0x%02x):", subaddress);
    for(i=0; i<transfer.dataSize;i++)
    	PRINTF("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    PRINTF("\r\n");
#endif
	return err;
}


void tfa98xx_convert_data2bytes(int num_data, const int data[],
                   unsigned char bytes[])
{
    int i;            /* index for data */
    int k;            /* index for bytes */
    int d;
    /* note: cannot just take the lowest 3 bytes from the 32 bit
     * integer, because also need to take care of clipping any
     * value > 2&23 */
    for (i = 0, k = 0; i < num_data; ++i, k += 3) {
        if (data[i] >= 0)
            d = MIN(data[i], (1 << 23) - 1);
        else {
            /* 2's complement */
            d = (1 << 24) - MIN(-data[i], 1 << 23);
        }
        bytes[k] = (d >> 16) & 0xFF;    /* MSB */
        bytes[k + 1] = (d >> 8) & 0xFF;
        bytes[k + 2] = (d) & 0xFF;    /* LSB */
    }
}

/** 
 convert memory bytes to signed 24 bit integers  
   input:  bytes contains "num_bytes" byte elements 
   output: data contains "num_bytes/3" int24 elements
*/
void tfa98xx_convert_bytes2data(int num_bytes, const unsigned char bytes[],
                   int data[])
{
    int i;            /* index for data */
    int k;            /* index for bytes */
    int d;
    int num_data = num_bytes / 3;
//    _ASSERT((num_bytes % 3) == 0);
    for (i = 0, k = 0; i < num_data; ++i, k += 3) {
        d = (bytes[k] << 16) | (bytes[k + 1] << 8) | (bytes[k + 2]);
//        _ASSERT(d >= 0);
//        _ASSERT(d < (1 << 24));    /* max 24 bits in use */
        if (bytes[k] & 0x80)    /* sign bit was set */
            d = -((1 << 24) - d);

        data[i] = d;
    }
}

Tfa9890_Error_t processPatchFile(uint8_t slave_address, int length, const unsigned char *bytes)
{
	unsigned short size;
	int index;

	i2c_master_transfer_t transfer;
	Tfa9890_Error_t err = Error_Ok;
    uint8_t retval = 0;
#if defined(DEMO_VERBOSE)
    int i;
#endif

	/* expect following format in patchBytes:
	* 2 bytes length of I2C transaction in little endian, then the bytes, excluding the slave address which is added from the handle
	* This repeats for the whole file
	*/
	index = 0;

	transfer.flags = 0;
	transfer.slaveAddress = slave_address;
	transfer.direction = kI2C_Write;
	transfer.subaddress = 0;
	transfer.subaddressSize = 0;

	while (index < length) {
		/* extract little endian length */
		size = bytes[index] + bytes[index + 1] * 256;
		index += 2;
		if ((index + size) > length) {
			/* too big, outside the buffer, error in the input data */
			return Error_Bad_Parameter;
		}
		if ((size + 1) > MAX_I2C_LENGTH) {
			/* too big, must fit buffer */
			return Error_Bad_Parameter;
		}

		transfer.data = (void *)(bytes + index);
		transfer.dataSize = size;

#ifdef TFA98XX_PRINT_DEBUG
		//printf("Bytes to be written_patch:%d (index = %d bytes[index] = %d bytes[index+1] = %d\r\n",size, index, bytes[index], bytes[index+1]);
#endif//
		retval = I2C_MasterTransferBlocking(DEMO_I2C, &transfer);
		if (retval != kStatus_Success)
		{
#ifdef TFA98XX_PRINT_DEBUG
			printf("I2C write error at \r\n",size);
#endif
			err = Error_I2C_Fatal;
			break;
		}
#if defined(DEMO_VERBOSE)
		for(i=0; i<transfer.dataSize;i++)
			PRINTF("[%02x]-", (unsigned char)((unsigned char *)transfer.data + i));
		PRINTF("\r\n");
#endif
		index += size;
	}
	return err;
}

uint16_t tfa_get_bf_value(const uint16_t bf, const uint16_t reg_value)
{
	uint16_t msk, value;

