embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/middleware/dsp/audio_framework/hifi4_app/plugins/cadence/capturer/evk_hal_registers.c
	/*
	 * bitfield enum:
	 * - 0..3  : len
	 * - 4..7  : pos
	 * - 8..15 : address
	 */
	uint8_t len = bf & 0x0f;
	uint8_t pos = (bf >> 4) & 0x0f;

	msk = ((1<<(len+1))-1)<<pos;
	value = (reg_value & msk) >> pos;

	return value;
}

/***************************** xmem only **********************************/
Tfa9890_Error_t tfa98xx_dsp_read_mem_tfa98xx(uint8_t slave_address, unsigned int start_offset, int num_words, int *pValues)
{
	Tfa9890_Error_t  error = Error_Ok;
	unsigned char *bytes;
	int burst_size;		/* number of words per burst size */
	const int bytes_per_word = 3;
	int dmem;
	int num_bytes;
	int *p;

	bytes = (unsigned char *)malloc(num_words*bytes_per_word);
	if (bytes == NULL)
		return Error_Other;

	/* If no offset is given, assume XMEM! */
	if(((start_offset>>16) & 0xf) > 0 )
		dmem = (start_offset>>16) & 0xf;
	else
		dmem = DMEM_XMEM;

	/* Remove offset from adress */
	start_offset = start_offset & 0xffff;
	num_bytes = num_words * bytes_per_word;
	p = pValues;

	tfa_set_bf_tfa98xx(slave_address, TFA2_BF_DMEM, (uint16_t)dmem);
	error = -tfa98xx_write_reg(slave_address, TFA2_BF_MADD, (unsigned short)start_offset);
	if (error != Error_Ok)
		goto tfa98xx_dsp_read_mem_exit;
	for (; num_bytes > 0;) {
		burst_size = ROUND_DOWN(NXP_I2C_MAX_SIZE, bytes_per_word);
		if (num_bytes < burst_size)
			burst_size = num_bytes;
		//_ASSERT(burst_size <= sizeof(bytes));
		error = Tfa98xx_ReadData( slave_address, FAM_TFA98XX_CF_MEM, burst_size, bytes);
		if (error != Error_Ok)
			goto tfa98xx_dsp_read_mem_exit;

		tfa98xx_convert_bytes2data(burst_size, bytes, p);

		num_bytes -= burst_size;
		p += burst_size / bytes_per_word;
	}

tfa98xx_dsp_read_mem_exit:
	free(bytes);
	return error;
}

Tfa9890_Error_t checkICROMversion(uint8_t slave_address, const unsigned char patchheader[])
{
	Tfa9890_Error_t error = Error_Ok;
	unsigned short checkrev;
	unsigned short checkaddress;
	int checkvalue;
	int value = 0;
	unsigned short status;
	checkrev = patchheader[0];
	if ((checkrev != 0xFF) && (checkrev != 0x94)) {
		return Error_Not_Supported;
	}
	checkaddress = (patchheader[1] << 8) + patchheader[2];
	checkvalue = (patchheader[3] << 16) + (patchheader[4] << 8) + patchheader[5];
	if (checkaddress != 0xFFFF) {
		/* before reading XMEM, check if we can access the DSP */
		error = read_register(slave_address, 0x00, &status);
		if (error == Error_Ok) {
			if ((status & 0x8000) != 0x8000) {
				/* one of Vddd, PLL and clocks not ok */
				error = Error_DSP_not_running;
			}
		}
		/* read some address register that allows checking the correct ROM version */
		if (error == Error_Ok) {
			error =	tfa98xx_dsp_read_mem_tfa98xx(slave_address, checkaddress, 1, &value);
		}
		if (error == Error_Ok) {
			if (value != checkvalue) {
					error = Error_Not_Supported;
			}
		}
	}
	return error;
}

int tfa98xx_write_reg(uint8_t slave_address, const uint16_t bf, const uint16_t reg_value)
{
	Tfa9890_Error_t err;

	/* bitfield enum - 8..15 : address */
	uint8_t address = (bf >> 8) & 0xff;

	err = write_register(slave_address, address, reg_value);
	return err;
}

Tfa9890_Error_t tfa98xx_dsp_stability_check(uint8_t slave_address, uint32_t *ready)
{
	Tfa9890_Error_t  error = Error_Ok;
	unsigned short status;
	int value;

	/* check the contents of the STATUS register */
	value = tfa98xx_read_reg(slave_address, TFA2_BF_AREFS);
	if (value < 0) {
		error = -value;
		*ready = 0;
		//_ASSERT(error);		/* an error here can be fatal */
#ifdef TFA98XX_PRINT_DEBUG
		printf("FATAL ERROR#######\r\n");
#endif//TFA98XX_PRINT_DEBUG
		return error;
	}
	status = (unsigned short)value;

	/* check AREFS and CLKS: not ready if either is clear */
	*ready = !((tfa_get_bf_value(TFA2_BF_AREFS, status) == 0)
		   || (tfa_get_bf_value(TFA2_BF_CLKS, status) == 0)
		     ||  (tfa_get_bf_value(TFA2_BF_MTPB, status) == 1));

	return error;
}
void tfa_updown_tfa98xx(uint8_t slave_address, int powerdown)
{
   tfa_set_bf_tfa98xx(slave_address,TFA2_BF_PWDN,(uint16_t)powerdown);
}

Tfa9890_Error_t  tfa_mute_tfa98xx(uint8_t slave_address,Tfa9891_Mute_t mute)
{
        Tfa9890_Error_t error;

        switch (mute) {
        case Mute_Off:
			  error = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_CFSM,(uint16_t)0);
			  error = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_AMPE,(uint16_t)1);
			  error = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_DCA,(uint16_t)1);
                break;
        case Mute_Digital:
                /* expect the amplifier to run */
                /* set the cf_mute bit */
        error = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_CFSM,(uint16_t)1);
		error = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_AMPE,(uint16_t)1);
		error = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_DCA,(uint16_t)0);
                break;
        default:
                error = Error_Bad_Parameter;
        }
        
            
		return error;
}

Tfa9890_Error_t tfa98xx_write_data_tfa98xx(uint8_t slave_address,
		  unsigned char subaddress, int num_bytes,
		  const unsigned char data[])
{
	i2c_master_transfer_t transfer;
	Tfa9890_Error_t err = Error_Ok;
    uint8_t retval = 0;
#if defined(DEMO_VERBOSE)
    int i;
#endif

	transfer.flags = 0;
	transfer.slaveAddress = slave_address;
	transfer.direction = kI2C_Write;
	transfer.subaddress = subaddress;
	transfer.subaddressSize = 1;
	transfer.data = (void *)data;
	transfer.dataSize = num_bytes;

	retval = I2C_MasterTransferBlocking(DEMO_I2C, &transfer);
    if (retval != kStatus_Success)
    {
        err = Error_I2C_Fatal;
    }
#if defined(DEMO_VERBOSE)
    PRINTF("W(0x%02x):", subaddress);
    for(i=0; i<transfer.dataSize;i++)
    	PRINTF("[0x%02x]", (unsigned char)((unsigned char *)transfer.data + i));
    PRINTF("\r\n");
#endif
	return err;
}

Tfa9890_Error_t tfa98xx_dsp_write_mem_word_tfa98xx(uint8_t slave_address, unsigned short address, int value, int memtype)
{
	Tfa9890_Error_t error = Error_Ok;
	unsigned char bytes[3];

	tfa_set_bf_tfa98xx(slave_address, TFA2_BF_DMEM, (uint16_t)memtype);
	error = - tfa98xx_write_reg(slave_address, TFA2_BF_MADD,address);
	if (error != Error_Ok)
		return error;
    tfa98xx_convert_data2bytes(1, &value, bytes);
	error = tfa98xx_write_data_tfa98xx(slave_address, 0x920f>>8, 3, bytes);

	return error;
}

Tfa9890_Error_t  tfa_dsp_msg_write_id_tfa98xx(uint8_t slave_address, int length, const char *buffer, uint8_t cmdid[3])
{
        int offset = 0;
		int chunk_size = ROUND_DOWN(NXP_I2C_MAX_SIZE, 3 /* XMEM word size */ );
	
	int remaining_bytes = length;
	Tfa9890_Error_t error = Error_Ok;
	uint16_t cfctl;
	int value;

	value = tfa98xx_read_reg(slave_address, TFA2_BF_DMEM);
	if (value < 0) {
		error = -value;
		return error;
	}
	cfctl = (uint16_t)value;
	/* assume no I2C errors from here */
	tfa98xx_set_bf_value(slave_address, TFA2_BF_DMEM, (uint16_t)DMEM_XMEM, &cfctl); /* set cf ctl to DMEM  */
	tfa98xx_set_bf_value(slave_address, TFA2_BF_AIF, 0, &cfctl ); /* set to autoincrement */
	tfa98xx_write_reg(slave_address, TFA2_BF_DMEM, cfctl);
	/* xmem[1] is start of message
	 *  direct write to register to save cycles avoiding read-modify-write
	 */
	tfa98xx_write_reg(slave_address, TFA2_BF_MADD, 1);
	/* write cmd-id */
	if(cmdid != NULL)
	error = tfa98xx_write_data_tfa98xx(slave_address, FAM_TFA98XX_CF_MEM, 3, (const unsigned char *)cmdid);

	/* due to autoincrement in cf_ctrl, next write will happen at
	 * the next address */
	while ((error == Error_Ok) && (remaining_bytes > 0)) {
		if (remaining_bytes < chunk_size)
			chunk_size = remaining_bytes;
		/* else chunk_size remains at initialize value above */
		error = tfa98xx_write_data_tfa98xx(slave_address, FAM_TFA98XX_CF_MEM,
				      chunk_size, (const unsigned char *)buffer + offset);
		remaining_bytes -= chunk_size;
		offset += chunk_size;
	}

	/* notify the DSP */
	if (error == Error_Ok) {
#ifdef TFA98XX_PRINT_DEBUG
		printf("Probably here 70 71 72, flow__Flow\r\n");
#endif//TFA98XX_PRINT_DEBUG
		/* cf_int=0, cf_aif=0, cf_dmem=XMEM=01, cf_rst_dsp=0 */
		/* set the cf_req1 and cf_int bit */
		tfa98xx_set_bf_value(slave_address, TFA2_BF_REQCMD, 0x01, &cfctl ); /* bit 0 */
		tfa98xx_set_bf_value(slave_address, TFA2_BF_CFINT, 1, &cfctl );
		error = -tfa98xx_write_reg(slave_address, TFA2_BF_CFINT, cfctl);
	}

	return error;
}

Tfa9890_Error_t 
tfa98xx_wait_result_tfa98xx(uint8_t slave_address, int wait_retry_count)
{
	Tfa9890_Error_t  error = Error_Ok;
	int cf_status; /* the contents of the CF_STATUS register */
	int tries = 0;
	do {
		cf_status = tfa_get_bf_tfa98xx(slave_address,TFA2_BF_ACK);
		if (cf_status < 0)
			error = -cf_status;
		tries++;
#ifdef TFA98XX_PRINT_DEBUG
		printf("We are inside tfa98xx_wait_result_tfa98xx,triesCF:%d--error:%d--cf_status & 0x01:%d\r\n",tries,error,cf_status & 0x01);
#endif//
	}
	// i2c_cmd_ack
	/* don't wait forever, DSP is pretty quick to respond (< 1ms) */
	while ((error == Error_Ok) && ((cf_status & 0x01) == 0)
			&& (tries < wait_retry_count));
	if (tries >= wait_retry_count) {
#ifdef TFA98XX_PRINT_DEBUG
		printf("Returning Error_DSP_not_running\r\n");
#endif//TFA98XX_PRINT_DEBUG
		/* something wrong with communication with DSP */
		error = Error_DSP_not_running;
	}
	return error;
}
/* read the return code for the RPC call */
Tfa9890_Error_t 
tfa98xx_check_rpc_status_tfa98xx(uint8_t slave_address, int *pRpcStatus)
{
	Tfa9890_Error_t  error = Error_Ok;
	/* the value to sent to the * CF_CONTROLS register: cf_req=00000000,
	 * cf_int=0, cf_aif=0, cf_dmem=XMEM=01, cf_rst_dsp=0 */
	unsigned short cf_ctrl = 0x0002;
	/* memory address to be accessed (0: Status, 1: ID, 2: parameters) */
	unsigned short cf_mad = 0x0000;
	if (pRpcStatus == 0)
		return Error_Bad_Parameter;
	/* 1) write DMEM=XMEM to the DSP XMEM */
	{
		/* minimize the number of I2C transactions by making use of the autoincrement in I2C */
		unsigned char buffer[4];
		/* first the data for CF_CONTROLS */
		buffer[0] = (unsigned char)((cf_ctrl >> 8) & 0xFF);
		buffer[1] = (unsigned char)(cf_ctrl & 0xFF);
		/* write the contents of CF_MAD which is the subaddress following CF_CONTROLS */
		buffer[2] = (unsigned char)((cf_mad >> 8) & 0xFF);
		buffer[3] = (unsigned char)(cf_mad & 0xFF);
		error = tfa98xx_write_data_tfa98xx(slave_address, FAM_TFA98XX_CF_CONTROLS, sizeof(buffer), buffer);
	}
	if (error == Error_Ok) {
		/* read 1 word (24 bit) from XMEM */
		error = tfa98xx_dsp_read_mem_tfa98xx(slave_address, 0, 1, pRpcStatus);
	}
	return error;
}
Tfa9890_Error_t tfa_dsp_msg_status_tfa98xx(uint8_t slave_address, int *pRpcStatus)
{
	Tfa9890_Error_t error = Error_Ok;
      	error = tfa98xx_wait_result_tfa98xx(slave_address, 10); /* 2 is only one try */
	if (error == Error_DSP_not_running) {
#ifdef TFA98XX_PRINT_DEBUG
		printf("return_not_running\r\n");
#endif//
		*pRpcStatus = -1;
		return Error_Ok;
	}
	else if (error != Error_Ok)
	{
#ifdef TFA98XX_PRINT_DEBUG
		printf("Error NtOk_NOOk:%d\r\n",error);
#endif//
		return error;
	}
	error = tfa98xx_check_rpc_status_tfa98xx(slave_address, pRpcStatus);
#ifdef TFA98XX_PRINT_DEBUG
      printf("rpcStatus:%d\r\n",*pRpcStatus);
#endif//
	 return error;
}
Tfa9890_Error_t tfa_dsp_msg_tfa98xxx(uint8_t slave_address, int length, const char *buf)
{
	Tfa9890_Error_t error;
	int tries, rpc_status = I2C_Req_Done;

	/* write the message and notify the DSP */
	error = tfa_dsp_msg_write_id_tfa98xx(slave_address, length, buf,NULL);
	if( error != Error_Ok)
		return error;
#ifdef TFA98XX_PRINT_DEBUG
	else
		printf("tfa_dsp_msg_write_id_tfa98xx error :%d\r\n",error);
#endif//

	/* get the result from the DSP (polling) */
	for(tries=TFA98XX_WAITRESULT_NTRIES; tries>0;tries--) {
#ifdef TFA98XX_PRINT_DEBUG
		printf("tries:%d\r\n",tries);
#endif//
		error = tfa_dsp_msg_status_tfa98xx(slave_address, &rpc_status);
                if (error == Error_Ok && rpc_status == I2C_Req_Done)
			break;
#ifdef TFA98XX_PRINT_DEBUG
				else
              printf("error_status:%d--rpc_status:%d\r\n",error,rpc_status);
#endif//

		/* If the rpc status is a specific error we want to know it.
		 * If it is busy or not running it should retry
		 */
		if(rpc_status != I2C_Req_Busy && rpc_status != DSP_Not_Running)
		{
#ifdef TFA98XX_PRINT_DEBUG
			printf("breaking------error\r\n");
#endif//
			break;
			}
	}

	if (rpc_status != I2C_Req_Done) {
#ifdef TFA98XX_PRINT_DEBUG
		printf("breaking2------error2\r\n");
#endif//
		/* DSP RPC call returned an error */
		error = (Tfa9890_Error_t) (rpc_status + Error_RpcBase);
               // pr_debug("DSP msg status: %d (%s)\r\n", rpc_status, tfa98xx_get_i2c_status_id_string(rpc_status));
	}

	return error;
}
Tfa9890_Error_t   tfa98xx_dsp_cmd_id_write_read(uint8_t slave_address,
			   unsigned char module_id,
			   unsigned char param_id, int num_bytes,
                           unsigned char data[])
{
	Tfa9890_Error_t error;
	unsigned char buffer[3];

	buffer[0] = 1;
	buffer[1] = module_id + 128;
	buffer[2] = param_id;


