embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/middleware/dsp/audio_framework/hifi4_app/plugins/cadence/capturer/evk_hal_registers.c
	error = tfa_dsp_msg_tfa98xxx(slave_address, sizeof(unsigned char[3]), (const char *)buffer);
	if (error != Error_Ok)
		return error;

	/* read the data from the dsp */
	error = tfa98xx_dsp_msg_read(slave_address, num_bytes, data);
	return error;
}
Tfa9890_Error_t Tfa9890_printCalibration(uint8_t slave_address)
{
	Tfa9890_Error_t error = Error_Ok;
	unsigned char bytes[6] = {0};
	int24 data[2];
	float mohm = 0.0;
	error = tfa98xx_dsp_cmd_id_write_read(slave_address,MODULE_SPEAKERBOOST,SB_PARAM_GET_RE0, 3, bytes);
	assert(error == Error_Ok);

	if (error == Error_Ok) {
		tfa98xx_convert_bytes2data(3, bytes, data);
		mohm = ((float)data[0]*1024)/TFA2_FW_ReZ_SCALE;
	}
	PRINTF(" Calibrated value :%1.2f mOhms :\r\n",mohm);

	return error;
}

Tfa9890_Error_t ClearOneTimeCalibration(uint8_t slave_address)
{
	Tfa9890_Error_t err = Error_Ok;
	unsigned short mtp;
	int tries=0, mtpBusy=0;

	//Unlock MTP register by writing 0x005A to register 0x0B
	err = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_OPENMTP,1);
	assert(err == Error_Ok);
	write_register(slave_address, 0x0F,(uint16_t)0x5A6B);
	write_register(slave_address, 0xA1,(uint16_t)0x005A);
	write_register(slave_address, 0x0F,(uint16_t)0);

	//Read MTP register
	read_register(slave_address, 0xF0, &mtp);

	//Set MTPEX=0 and MTPOTC=0 to clear current calibration status
	mtp &= ~(0x03);
	write_register(slave_address, 0xF0, mtp);
	err = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_CIMTP,1);
	assert(err == Error_Ok);
	write_register(slave_address, 0x0F,(uint16_t)0x5A6B);
	write_register(slave_address, 0xA1,(uint16_t)0);
	write_register(slave_address, 0x0F,(uint16_t)0);
	assert(err == Error_Ok);
	do
	{
		tries++;
		mtpBusy = tfa_get_bf_tfa98xx(slave_address, TFA2_BF_MTPB);
	} while ((mtpBusy == 0x01) && (tries < TFA98XX_API_WAITRESULT_NTRIES));

	if (tries==TFA98XX_API_WAITRESULT_NTRIES)
	{
#ifdef TFA98XX_PRINT_DEBUG
		printf("MTP Busy timedout\r\n");
#endif//TFA98XX_PRINT_DEBUG
		err = Error_StateTimedOut;
	}
	return err;
}

#ifdef FACTORY_CALIBRATION_ONLY
void SetOneTimeCalibration(uint8_t slave_address)
{
	Tfa9890_Error_t err = Error_Ok;

	unsigned short mtp;
	int tries=0, mtpBusy=0;

	err = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_OPENMTP,1);
	assert(err == Error_Ok);
	//Unlock MTP register by writing 0x005A to register 0x0B
	write_register(slave_address, 0x0F,(uint16_t)0x5A6B);
	write_register(slave_address, 0xA1,(uint16_t)0x005A);
	write_register(slave_address, 0x0F,(uint16_t)0);
	read_register(slave_address, 0xF0, &mtp);
	//Clear MTPEX
	mtp |=0x01;
	write_register(slave_address, 0xF0, mtp);
	err = tfa_set_bf_tfa98xx(slave_address,TFA2_BF_CIMTP,1);
	assert(err == Error_Ok);
	write_register(slave_address, 0x0F,(uint16_t)0x5A6B);
	write_register(slave_address, 0xA1,(uint16_t)0);
	write_register(slave_address, 0x0F,(uint16_t)0);
	tries = 0;
	do
	{
		tries++;
		Sleep(10);
		mtpBusy = tfa_get_bf_tfa98xx(slave_address, TFA2_BF_MTPB);
	} while ((mtpBusy == 0x01) && (tries < TFA98XX_API_WAITRESULT_NTRIES));

	if (tries==TFA98XX_API_WAITRESULT_NTRIES)
	{
#ifdef TFA98XX_PRINT_DEBUG
		printf("MTP Busy timedout\r\n");
#endif//TFA98XX_PRINT_DEBUG
		err = Error_StateTimedOut;
	}
}
#endif//FACTORY_CALIBRATION_ONLY

Tfa9890_Error_t tfa98xx_dsp_msg_read(uint8_t slave_address, int length, unsigned char *bytes)
{
	Tfa9890_Error_t error = Error_Ok;
	int burst_size;		/* number of words per burst size */
	int num_bytes;
	int offset = 0;
	unsigned short start_offset=2; /* msg starts @xmem[2] ,[1]=cmd */


	tfa_set_bf_tfa98xx(slave_address, TFA2_BF_DMEM, (uint16_t)DMEM_XMEM);
	error = -tfa98xx_write_reg(slave_address, TFA2_BF_MADD, start_offset);
	if (error != Error_Ok)
		return error;

	num_bytes = length; /* input param */
	while (num_bytes > 0) {
		burst_size = ROUND_DOWN(NXP_I2C_MAX_SIZE, 3);
		if (num_bytes < burst_size)
			burst_size = num_bytes;
		error = Tfa98xx_ReadData(slave_address, FAM_TFA98XX_CF_MEM, burst_size, bytes + offset);
		if (error != Error_Ok)
			return error;

		num_bytes -= burst_size;
		offset += burst_size;
	}

	return error;
}

Tfa9890_Error_t tfa_dsp_cmd_id_write_tfa98xx(uint8_t slave_address,
			   unsigned char module_id,
			   unsigned char param_id, int num_bytes,
                           const unsigned char data[])
{
	Tfa9890_Error_t error;
	unsigned char *buffer;

	buffer = malloc(3 + num_bytes);
	if (buffer == NULL)
		return Error_Other;

	buffer[0] = 1;
	buffer[1] = module_id + 128;
	buffer[2] = param_id;

	memcpy(&buffer[3], data, num_bytes);

	error = tfa_dsp_msg_tfa98xxx(slave_address, 3 + num_bytes, (const char *)buffer);

	free(buffer);

	return error;
}
Tfa9890_Error_t  tfaRunWriteBitfieldTfa98xx(uint8_t slave_address,  nxpTfaBitfieldTfa98xx_t bf) {
	Tfa9890_Error_t error;
        uint16_t value;
	union {
		uint16_t field;
		nxpTfaBfEnumTfa98xx_t Enum;
	} bfUni;
        
	value=bf.value;
	bfUni.field = bf.field;
    error = tfa_set_bf_tfa98xx(slave_address, bfUni.field, value);

	return error;
}
#ifdef TFA98XX_PRINT_DEBUG
void printArray(char *ptr, size_t size)
{
    char *const end = ptr + size;
    while( ptr < end ) {
        printf("[%x]-", *ptr++);        
    }
}
#endif//TFA98XX_PRINT_DEBUG
/**********************************/
Tfa9890_Error_t  tfa_dsp_msg_id_tfa98xx(uint8_t slave_address, int length, const char *buf, uint8_t cmdid[3])
{
	Tfa9890_Error_t error;
	int tries, rpc_status = I2C_Req_Done;

	/* write the message and notify the DSP */
	error = tfa_dsp_msg_write_id_tfa98xx(slave_address, length, buf, cmdid);
	if( error != Error_Ok)
	{
		printf(" Return error-----error\r\n");
		return error;
	}
	/* get the result from the DSP (polling) */
	for(tries=40; tries>0;tries--) {
		error = tfa_dsp_msg_status_tfa98xx(slave_address, &rpc_status);
                if (error == Error_Ok && rpc_status == I2C_Req_Done)
			break;
	}
	if (rpc_status != I2C_Req_Done) {
		/* DSP RPC call returned an error */
		error = (Tfa9890_Error_t) (rpc_status + Error_RpcBase);
                //pr_debug("DSP msg status: %d (%s)\r\n", rpc_status, tfa98xx_get_i2c_status_id_string(rpc_status));
	}

	return error;
}
/*****************************/
Tfa9890_Error_t  tfaContWriteVstepMax2_tfa98xx(uint8_t slave_address, nxpTfaVolumeStepMax2FileTfa98xx_t *vp, int vstep_idx, int vstep_msg_idx)
{
	Tfa9890_Error_t err = Error_Ok;
	struct nxpTfaVolumeStepRegisterInfoTfa98xx *regInfo = {0};
	struct nxpTfaVolumeStepMessageInfoTfa98xx *msgInfo = {0};
	nxpTfaBitfieldTfa98xx_t bitF;
	int msgLength=0, i, j, size=0, nrMessages, modified=0;
	uint8_t cmdid_changed[3];
#ifdef TFA98XX_PRINT_DEBUG
	printArray((char *)vp,50);
#endif//TFA98XX_PRINT_DEBUG
	if(vstep_idx >= vp->NrOfVsteps) {
#ifdef TFA98XX_PRINT_DEBUG
		printf("Volumestep %d is not available \r\n", vstep_idx);
#endif//
		return Error_Bad_Parameter;
	}
#ifdef TFA98XX_PRINT_DEBUG
	else
     printf("vp->NrOfVsteps:%d---vstep_idx %d--sizeof(nxpTfaHeaderTfa98xx_t):%d\r\n",vp->NrOfVsteps,vstep_idx,sizeof(nxpTfaHeaderTfa98xx_t));
#endif
	for(i=0; i<=vstep_idx; i++) {
		regInfo = (struct nxpTfaVolumeStepRegisterInfoTfa98xx*)(vp->vstepsBin + size);
		msgInfo = (struct nxpTfaVolumeStepMessageInfoTfa98xx*)(vp->vstepsBin+
				(regInfo->NrOfRegisters * sizeof(uint32_t)+sizeof(regInfo->NrOfRegisters)+size));

		nrMessages = msgInfo->NrOfMessages;
#ifdef TFA98XX_PRINT_DEBUG
		printf("nrMessages:%d\r\n",nrMessages);
#endif//
		for(j=0; j<nrMessages; j++) {
			/* location of message j, from vstep i */
			msgInfo = (struct nxpTfaVolumeStepMessageInfoTfa98xx*)(vp->vstepsBin+
					(regInfo->NrOfRegisters * sizeof(uint32_t)+sizeof(regInfo->NrOfRegisters)+size));
			/* message length */
			msgLength = ( (msgInfo->MessageLength.b[0] << 16) + (msgInfo->MessageLength.b[1] << 8) + msgInfo->MessageLength.b[2]);
#ifdef TFA98XX_PRINT_DEBUG
			printf("nrMessages:%d--msgLength:%d--MessageType:%d\r\n",j,msgLength,msgInfo->MessageType);
#endif//
			if (i == vstep_idx) {
				/* If no vstepMsgIndex is passed on, all message needs to be send */
				if ((vstep_msg_idx >= TFA_MAX_VSTEP_MSG_MARKER) || (vstep_msg_idx == j)) {
					/* 
					 * The algoparams and mbdrc msg id will be changed to the reset type when SBSL=0
					 * if SBSL=1 the msg will remain unchanged. It's up to the tuning engineer to choose the 'without_reset' 
					 * types inside the vstep. In other words: the reset msg is applied during SBSL==0 else it remains unchanged.
					 */
					if (tfa_get_bf_tfa98xx(slave_address, TFA2_BF_SBSL) == 0) {
						if(msgInfo->MessageType == 0) { /* If the messagetype(0) is AlgoParams */
#ifdef TFA98XX_PRINT_DEBUG
							printf("SBSL NULL MessageType NULL\r\n");
#endif//
							/* Only do this when not set already */
							if(msgInfo->CmdId[2] != SB_PARAM_SET_ALGO_PARAMS) {
#ifdef TFA98XX_PRINT_DEBUG
								printf("CmdId[2] != SB_PARAM_SET_ALGO_PARAMS\r\n");
#endif//
								cmdid_changed[0] = msgInfo->CmdId[0];
								cmdid_changed[1] = msgInfo->CmdId[1];
								cmdid_changed[2] = SB_PARAM_SET_ALGO_PARAMS;
								modified = 1;
							}
#ifdef TFA98XX_PRINT_DEBUG
							else
								printf("CmdId[2] == SB_PARAM_SET_ALGO_PARAMS\r\n");
#endif//
						} else if(msgInfo->MessageType == 2) { /* If the messagetype(2) is MBDrc */
							/* Only do this when not set already */
#ifdef TFA98XX_PRINT_DEBUG
							printf("SBSL NULL MessageType 2-2-2\r\n");
#endif//
							if(msgInfo->CmdId[2] != SB_PARAM_SET_MBDRC) {
#ifdef TFA98XX_PRINT_DEBUG
								printf("msgInfo->CmdId[2] != SB_PARAM_SET_MBDRC\r\n");
#endif//
								cmdid_changed[0] = msgInfo->CmdId[0];
								cmdid_changed[1] = msgInfo->CmdId[1];
								cmdid_changed[2] = SB_PARAM_SET_MBDRC;
								modified = 1;
							}
#ifdef TFA98XX_PRINT_DEBUG
							else
								printf("msgInfo->CmdId[2] == SB_PARAM_SET_MBDRC\r\n");
#endif//
						}
					}
#ifdef TFA98XX_PRINT_DEBUG
					else
							printf("SBSL TRUE--TRUE\r\n");
#endif//
					/* Messagetype(3) is Smartstudio Info! Dont send this! */
					if(msgInfo->MessageType != 3) { 
						if(modified == 1) {
#ifdef TFA98XX_PRINT_DEBUG
								if(cmdid_changed[2] == SB_PARAM_SET_ALGO_PARAMS)
									printf("P-ID for SetAlgoParams modified!: ");
								else
									printf("P-ID for SetMBDrc modified!: ");

								printf("Command-ID used: 0x%02x%02x%02x \r\n",
									cmdid_changed[0], cmdid_changed[1], cmdid_changed[2]);
							/* Send payload to dsp (Remove 1 from the length for cmdid) */
							printf("Send Payload DSP :tfa_dsp_msg_id:((msgLength-1) * 3) %d:\r\n",(msgLength-1) * 3);
#endif//
							err = tfa_dsp_msg_id_tfa98xx(slave_address, (msgLength-1) * 3, (const char *)msgInfo->ParameterData, cmdid_changed);
							if (err != Error_Ok)
								return err;
						} else {
							/* Send cmdId + payload to dsp */
#ifdef TFA98XX_PRINT_DEBUG
							printf("Send cmdId + payload to dsp :tfa_dsp_msg_id:(msgLength * 3) %d:\r\n",msgLength * 3);
#endif//
						   err = tfa_dsp_msg_tfa98xxx(slave_address, msgLength * 3,(const char *)msgInfo->CmdId);
							//dsp_msg(devs[0], msgLength * 3,(const char *)msgInfo->CmdId);
							if (err != Error_Ok)
								return err;
						}
					
