embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/middleware/dsp/audio_framework/hifi4_app/plugins/cadence/capturer/evk_hal_registers.c
						/* Set back to zero every time */
						modified = 0;
					}
				}
			}

			if(msgInfo->MessageType == 3) {
				/* MessageLength is in bytes */
				size += sizeof(msgInfo->MessageType) + sizeof(msgInfo->MessageLength) + msgLength;
			} else {
				/* MessageLength is in words (3 bytes) */
				size += sizeof(msgInfo->MessageType) + sizeof(msgInfo->MessageLength) + sizeof(msgInfo->CmdId) + ((msgLength-1) * 3);
			}
		}
		size += sizeof(regInfo->NrOfRegisters) + (regInfo->NrOfRegisters * sizeof(uint32_t)) + sizeof(msgInfo->NrOfMessages);
	}

	if (regInfo->NrOfRegisters == 0) {
#ifdef TFA98XX_PRINT_DEBUG
		printf("No registers in selected vstep (%d)!\r\n", vstep_idx);
#endif//
		return Error_Bad_Parameter;
	}

	for(i=0; i<regInfo->NrOfRegisters*2; i++) {
		/* Byte swap the datasheetname */
		bitF.field = (uint16_t)(regInfo->registerInfo[i]>>8) | (regInfo->registerInfo[i]<<8);
		i++;
		bitF.value = (uint16_t)regInfo->registerInfo[i]>>8;
#ifdef TFA98XX_PRINT_DEBUG
		printf("bitF.field:%x--bitF.value:%x\r\n",bitF.field,bitF.value);
#endif//
		err = tfaRunWriteBitfieldTfa98xx(slave_address , bitF);
		if (err != Error_Ok)
			return err;
	}
	return err;
}

Tfa9890_Error_t tfa98xxdsp_get_calibration_impedance(uint8_t slave_address,float *pRe25)
{
	Tfa9890_Error_t  error = Error_Ok;
	int spkr_count=1, nr_bytes, i;
	unsigned char bytes[6] = {0};
	int data[2];

	nr_bytes = spkr_count * 3;
	if (tfa_get_bf_tfa98xx(slave_address, TFA2_BF_MTPOTC))
	{
		*pRe25 =   (tfa_get_bf_tfa98xx(slave_address, TFA2_MTP_RE25)*1000)/1024;
	}
	else {
		error = tfa98xx_dsp_cmd_id_write_read(slave_address,MODULE_SPEAKERBOOST,SB_PARAM_GET_RE0, nr_bytes, bytes);
		if (error == Error_Ok) {
			tfa98xx_convert_bytes2data(nr_bytes, bytes, data);
			for(i=0; i<spkr_count; i++) {
				*pRe25 = (data[i]*1024 )/TFA2_FW_ReZ_SCALE;
			}
		}
		else {
			for(i=0; i<spkr_count; i++)
				*pRe25 = -1;
		}
	}

	return error;
}

Tfa9890_Error_t tfa98xxRunWaitCalibration(uint8_t slave_address, int *calibrateDone)
{
	Tfa9890_Error_t err = Error_Ok;
	int tries = 0, mtp_busy = 1, tries_mtp_busy = 0;
	int i;

	*calibrateDone = 0;
	
	/* in case of calibrate once wait for MTPEX */
	if (tfa_get_bf_tfa98xx(slave_address, TFA2_BF_MTPOTC)) {
		// Check if MTP_busy is clear!
		while (tries_mtp_busy < 50)
		{
			mtp_busy = tfa_get_bf_tfa98xx(slave_address, TFA2_BF_MTPB);
			if (mtp_busy == 1)
				for(i=0;i<0xfff;i++);//msleep_interruptible(10); /* wait 10ms to avoid busload */
			else
				break;
			tries_mtp_busy++;
		}

		if (tries_mtp_busy < 50) {
			/* Because of the msleep TFA98XX_API_WAITRESULT_NTRIES is way to long! 
				* Setting this to 25 will take it atleast 25*50ms = 1.25 sec 
				*/
			while ( (*calibrateDone == 0) && (tries < 50)) {	
				*calibrateDone = tfa_get_bf_tfa98xx(slave_address, TFA2_BF_MTPEX);
				if(*calibrateDone == 1)
					break;
				for(i=0;i<0xfff;i++);//msleep_interruptible(50); /* wait 50ms to avoid busload */
				tries++;
			}

			if (tries >= 50) {
				tries = 3000;
			}
		}
#ifdef TFA98XX_PRINT_DEBUG
		else {
			printf("MTP bussy after %d tries\r\n", 50);
		}
#endif
	}

	/* poll xmem for calibrate always 
		* calibrateDone = 0 means "calibrating",
		* calibrateDone = -1 (or 0xFFFFFF) means "fails"
		* calibrateDone = 1 means calibration done 
		*/
	while ((*calibrateDone != 1) && (tries<3000)) {
		err = tfa98xx_dsp_read_mem_tfa98xx(slave_address, 516, 1, calibrateDone); 
																																																																																																																								tries++;
	}

	if(*calibrateDone != 1) {
		printf("Calibration failed! \r\n");
		err = Error_Bad_Parameter;
	} else if(tries==3000) {
		printf("Calibration has timedout! \r\n");
		err = Error_StateTimedOut;
	} else if(tries_mtp_busy == 1000) {
		printf("Calibrate Failed: MTP_busy stays high! \r\n");
		err = Error_StateTimedOut;
	}
	return err;
}

#ifdef TFA_ENABLE_LIVEDATA_CAPTURE
#define LSMODEL_MAX_WORDS            150
#define LIVEDATA_ITEMS_LENGTH        22
#define FW_PAR_ID_GET_MEMTRACK       0x8B
int GetscalingFactor(char ItemId)
{
	switch (ItemId) {
	case 0:
	case 1:
		return 16384;
	case 2:
	case 9:
	case 10:
	case 11:
	case 15:
		return 1;
	case 16:
	case 17:
		return 2097152;
	case 18:
	case 19:
		return 524288;
	case 3:
	case 4:
	case 5:
	case 6:
	case 7:
	case 8:
	case 12:
	case 13:
	case 14:
	case 20:
	case 21:
		return 65536;
	default:
		return 1;
	}
}

void tfa98xxRetrieveLiveData(uint8_t slave_address,float *live_data)
{
	Tfa9890_Error_t err = Error_Ok;
	int ItemId = 0;
	unsigned char *bytes = malloc(sizeof(unsigned char) * ((LSMODEL_MAX_WORDS * 3)+1));
	int *data = malloc(sizeof(int) * 151); /* 150 + 1*/

	err = tfa98xx_dsp_cmd_id_write_read(slave_address, MODULE_FRAMEWORK, FW_PAR_ID_GET_MEMTRACK, (LIVEDATA_ITEMS_LENGTH* 3)+3, bytes);
	assert(err == Error_Ok);
	tfa98xx_convert_bytes2data(3 * LIVEDATA_ITEMS_LENGTH, bytes + 3, data);

	if(slave_address == LEFT_AMP)
		printf("tChip_P,T_P,activity_P,AGCenvelope_P,preLIMenvelope_P,LIMenvelope_P,AGCgain_P,preLIMgain_P,LIMgain_P,ampClip_P,damageT_P,damageFres_P,sBiasProtSS_P,sBiasClip_P,sBias_P,fRes_P,X_P,Xout_P,sideChainX_P,sideChainS_P,mbdrcAGCgain_P,mbdrcAGCenvelope_P\r\n");
	else
		if (slave_address == RIGHT_AMP)
			printf("tChip_S,T_S,activity_S,AGCenvelope_S,preLIMenvelope_S,LIMenvelope_S,AGCgain_S,preLIMgain_S,LIMgain_S,ampClip_S,damageT_S,damageFres_S,sBiasProtSS_S,sBiasClip_S,sBias_S,fRes_S,X_S,Xout_S,sideChainX_S,sideChainS_S,mbdrcAGCgain_S,mbdrcAGCenvelope_S\r\n");
	for  (ItemId = 0; ItemId < LIVEDATA_ITEMS_LENGTH; ItemId++)
	{
		//printf("(float)data[ItemId]:%f--GetscalingFactor(ItemId):%d\r\n,",(float)data[ItemId],GetscalingFactor(ItemId));
		live_data[ItemId]= (float)data[ItemId]/GetscalingFactor(ItemId);
		printf("%f,",live_data[ItemId]);

	}
	printf("/n");
	free(bytes);
	free(data);
}
#endif/* TFA_ENABLE_LIVEDATA_CAPTURE */
